Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalModelData
Gets the analytical model data at the current iteration step.
Returns:
The retrieved model data.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetOtherAnalyticalNode
Gets the other analytical node at the current iteration step.
Returns:
The retrieved analytical node, null if the current iteration step does not have additional analytical node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalNode
Gets the analytical node at the current iteration step.
Returns:
The retrieved node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalSegment
Gets the analytical segment at the current iteration step.
Returns:
The retrieved segment, may be null for the first step.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Next
Moves this iterator to the next step of network iteration.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.End
Checks if the network iteration has completed.
Returns:
True if all analytical segments and nodes have been visited, otherwise false.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Start
Gets the first step of network iteration.
Remarks:
The first step may not contain any analytical segment, but the first analytical node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.CurrentElementId
The element id at the current iteration step.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemClassification
The optional MEP system classification where the iterations are restricted.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemId
The optional MEP system element id where the iterations are restricted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.MEPAnalyticalNode,Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment)
Creates an iterator to visit the connected segments on one side of the network.
pADoc:
The document of the analytical network.
startNode:
The starting analytical node. It must be one of two nodes of the starting segment.
startSegment:
The starting analytical segment to specify the traversing direction from the starting node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData,Autodesk.Revit.DB.ConnectorDomainType)
Creates an iterator by the analytical model data to visit all connected components in the network.
pADoc:
The document of the analytical network.
seed:
The analytical model data of the starting element.
eDomain:
The domain of network that the iteration happens.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkIterator
An iterator to traverse the MEP analytical network.
Remarks:
The iterator will visit the entire MEP analytical network in the depth-first order. For evert next step,
one analytical node and one analytical segment are typically visited. Sometimes an extra node is
provided if the iteration reaches the end on one side and restarts at the previous intersect node.
Also note that the start step may not contain any segment.
Since:
2024